app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(school_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-12-17 19:02:46.764394"], ["updated_at", "2018-12-17 19:02:46.764394"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-12-17 20:28:51.966506"], ["id", 1]]